&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период.ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса());
	Период.ДатаОкончания = КонецМесяца(ТекущаяДатаСеанса());
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьИтоговуюСуммуПоКонтракту(Команда)
	
	Состояние("Выполняется обработка",, "Подождите", БиблиотекаКартинок.Обработка);
	РассчитатьИтоговуюСуммуПоКонтрактуНаСервере();
	ПоказатьОповещениеПользователя("Выполнено");
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтоговуюСуммуПоКонтрактуНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНач", Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", Период.ДатаОкончания);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЕИС_ТранспортныйКонтейнер.Ссылка
		|ИЗ
		|	Документ.ЕИС_ТранспортныйКонтейнер КАК ЕИС_ТранспортныйКонтейнер
		|ГДЕ
		|	ЕИС_ТранспортныйКонтейнер.СуммаДокумента = 0
		|	И НЕ ЕИС_ТранспортныйКонтейнер.ПометкаУдаления
		|	И ЕИС_ТранспортныйКонтейнер.Дата МЕЖДУ &ДатаНач И &ДатаКон";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Док = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		Док.Записать();
	КонецЦикла;

КонецПроцедуры

