
&НаКлиенте
Процедура ЗаполнитьИзКонтрактногоТовара(Команда)
	
	ЗаполнитьИзКонтрактногоТовараНаСервере();
	Элементы.Список.Обновить();
	
	ПоказатьОповещениеПользователя("Выполнено");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИзКонтрактногоТовараНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	еисКонтрактныеТовары.Ссылка КАК КонтрактныйТовар,
		|	еисКонтрактныеТовары.Номенклатура КАК Номенклатура
		|ИЗ
		|	Справочник.еисКонтрактныеТовары КАК еисКонтрактныеТовары
		|ГДЕ
		|	еисКонтрактныеТовары.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяЗапись = РегистрыСведений.кб99_СоответствияТоваровЕИС.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(НоваяЗапись, ВыборкаДетальныеЗаписи);
		НоваяЗапись.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры
