
&НаКлиенте
Процедура Загрузить(Команда)
	
	Если ЗначениеЗаполнено(Объект.Наименование) Тогда
		ЗагрузитьНаСервере();
	Иначе
		ЕИС_Клиент.СообщитьИнфо("Укажите Адрес");	
	КонецЕсли;
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	
	Результат = ГМ_ЕИС.ВыполнитьЗапросГАР_API(Объект.Наименование);
	
	Если Результат["Ошибка"] <> Неопределено Тогда
		ГМ_ЕИС.СообщитьИнфо(Результат["Ошибка"]);
		Возврат;
	Иначе
		Если Не ЗначениеЗаполнено(Результат["guid"]) Тогда
			ГМ_ЕИС.СообщитьИнфо("В государственном адресном реестре не найдена информация об адресе["+Объект.Наименование+"]");
		КонецЕсли;
		Объект.ПолноеНаименование = Результат["НаименованиеПоКлассификатору"];
		Объект.GUID = Результат["guid"];
		Объект.Регион = Результат["Регион"];
		Объект.ОКТМО = Результат["ОКТМО"];
	КонецЕсли;
		
КонецПроцедуры