
&НаСервере
Процедура ДобавитьЗаписиВРегистр()
	
	ТекстовыйФайл = ПолучитьИмяВременногоФайла("csv");
	
	МакетФайла = РегистрыСведений.кб99_КодыРегионаПоИндексу.ПолучитьМакет("кб99_ЕИС_КодыРегионаПоИндексу");
	МакетФайла.Записать(ТекстовыйФайл);

	ЗагружаемыйФайл = Новый ТекстовыйДокумент;
	ЗагружаемыйФайл.Прочитать(ТекстовыйФайл);
	Разделитель = ";";
	
	Для НомерСтроки=2 по ЗагружаемыйФайл.КоличествоСтрок() Цикл
				
		Строка = ЗагружаемыйФайл.ПолучитьСтроку(НомерСтроки);
		МассивКолонок = ГМ_ЕИС.СтрРазделить82(Строка, Разделитель);
				
		Индексы = ГМ_ЕИС.СтрРазделить82(МассивКолонок[3], ",");
		КодыРегионов = ГМ_ЕИС.СтрРазделить82(МассивКолонок[2], ",");
		Для Каждого Инд Из Индексы Цикл
			Запись = РегистрыСведений.кб99_КодыРегионаПоИндексу.СоздатьМенеджерЗаписи();
		    Запись.Индекс = Инд;
			Запись.НаименованиеРегиона = МассивКолонок[0];
			Запись.КодРегиона = КодыРегионов[0];
			Запись.Записать(Истина);
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИзФайла(Команда)

	ДобавитьЗаписиВРегистр();
	Элементы.Список.Обновить();
	
	ПоказатьОповещениеПользователя("Выполнено");
	
КонецПроцедуры