&НаКлиенте
Процедура ДобавитьФайл(Команда)
	
	РежимДиалога = РежимДиалогаВыбораФайла.Открытие;
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалога);
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Ложь;
	ДиалогВыбораФайла.МножественныйВыбор = Ложь;
	ДиалогВыбораФайла.Заголовок = Нстр("ru = 'Выберите файл'");
	
	Если ДиалогВыбораФайла.Выбрать() Тогда
		НайденныеСтроки = Объект.ПрикрепленныеФайлы.НайтиСтроки(Новый Структура("Путь", ДиалогВыбораФайла.ПолноеИмяФайла));
		Если Не НайденныеСтроки.Количество() Тогда
			нСтр = Объект.ПрикрепленныеФайлы.Добавить();
			нСтр.Путь = ДиалогВыбораФайла.ПолноеИмяФайла;
		Иначе
			ОбщегоНазначенияКлиент.СообщитьПользователю("Выбранный файл уже добавлен");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
