
&После("ПриСозданииНаСервере")
Процедура кб_ПриСозданииНаСервере(Форма, ДополнительныеПараметры)
	Если Форма.ИмяФормы = "Справочник.Номенклатура.Форма.ФормаЭлемента" Тогда
		
		#Область ДобавлениеРеквизитовФормы
		// Массив для новых реквизитов
		ДобавляемыеРеквизиты	= Новый Массив;
		
		// Опишем ревизиты формы
		Реквизит_еисКодТовара = Новый РеквизитФормы("еисКодТовара",	Новый ОписаниеТипов("Строка", , , Новый КвалификаторыСтроки(300)),	, "Код товара ЕИС");
		
		// Заполним массив после описания реквизитов формы
		ДобавляемыеРеквизиты.Добавить(Реквизит_еисКодТовара);
		
		// Добавим новые реквизиты в форму
		Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
		#КонецОбласти
		
		#Область ДобавлениеЭлементовФормы
		// Элементы
		ИмяГруппы = "ГруппаДополнительныеРеквизиты";
		ГруппаФормы = Форма.Элементы.Найти(ИмяГруппы);
		Если ГруппаФормы <> Неопределено Тогда
			
			ИмяЭлемента = "еисКодТовара";
			Если Форма.Элементы.Найти(ИмяЭлемента) = Неопределено Тогда
				ЭлементФормы = Форма.Элементы.Добавить(ИмяЭлемента, Тип("ПолеФормы"), ГруппаФормы);        
				ЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
				ЭлементФормы.ПутьКДанным = "Объект.еисКодТовара";
				//ЭлементФормы.МногострочныйРежим = Истина;
				//ЭлементФормы.Высота = 3;
			КонецЕсли;   
			
		КонецЕсли;
		#КонецОбласти
		
		#Область ЗаполнениеДанных
		Форма.еисКодТовара = Форма.Объект.еисКодТовара;
		#КонецОбласти
		
	КонецЕсли;
КонецПроцедуры
