
Процедура ПередЗаписью(Отказ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	еисНастройки.Ссылка
		|ИЗ
		|	Справочник.еисНастройки КАК еисНастройки
		|ГДЕ
		|	еисНастройки.Организация = &Организация
		|	И еисНастройки.Пользователь = &Пользователь
		|	&ССылка";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ССылка", 
		?(ЗначениеЗаполнено(Ссылка), "И еисНастройки.Ссылка <> &Ссылка", ""));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		ТекстОшибки = "";
		
		Если ЗначениеЗаполнено(Пользователь) Тогда
			ТекстОшибки = "Для пользователя " + Пользователь + " ";	
		КонецЕсли;
		
		ТекстОшибки = ТекстОшибки + "В информационной базе уже введены настройки по организации: " + Организация;
				
		ГМ_ЕИС.СообщитьИнфо(ТекстОшибки,,,,Отказ);
		
	КонецЕсли;
	
КонецПроцедуры
